#### Load the Titanic dataset (available in seaborn) into a pandas DataFrame

In [1]:
import seaborn as sns

In [156]:
df = sns.load_dataset('titanic')

#### Find the average age of passengers for each class (1st, 2nd, and 3rd).

In [157]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [14]:
df.groupby(by = df['class']).mean()['age']

class
First     38.233441
Second    29.877630
Third     25.140620
Name: age, dtype: float64

In [13]:
import warnings
warnings.filterwarnings(action = 'ignore')

#### Create a new DataFrame that contains the count of male and female passengers in each age group (e.g., 0-10, 11-20, etc.).

In [15]:
age_bins = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
age_labels = ['0-10', '11-20', '21-30', '31-40', '41-50', '51-60', '61-70', '71-80', '81-90', '91-100']

In [17]:
df['age Group'] = pd.cut(df['age'], bins=age_bins, labels=age_labels, right=False)

In [18]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age Group
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,21-30
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,31-40
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,21-30
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,31-40
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,31-40
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,21-30
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,11-20
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,21-30
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,31-40

In [29]:
age_group_counts = df.groupby(['age Group', 'sex']).size().unstack(fill_value=0)

In [30]:
age_group_counts

sex        female  male
age Group
0-10           30    32
11-20          45    57
21-30          72   148
31-40          60   107
41-50          32    57
51-60          18    30
61-70           4    15
71-80           0     6
81-90           0     1
91-100          0     0

#### Find the name and ticket number of the passenger(s) who paid the highest fare and survived the disaster.

In [32]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age Group
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,21-30
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,31-40
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,21-30
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,31-40
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,31-40
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,21-30
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,11-20
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,21-30
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,31-40

#### Calculate the survival rate for passengers who were traveling alone (without any siblings, spouses, parents, or children) versus those who were traveling with family members.

In [33]:
df['family'] = df.sibsp + df.parch

In [34]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age Group,family
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,21-30,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,31-40,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,21-30,0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,31-40,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,31-40,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,21-30,0
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,11-20,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN,3
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,21-30,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,31-40,0

In [54]:
df1 = df.groupby(by = df.family).size()

In [57]:
family_series = pd.Series([537, 161, 102, 29, 15, 22, 12, 6, 7], index=[0, 1, 2, 3, 4, 5, 6, 7, 10])
family_df = pd.DataFrame({'Family Count': family_series})

In [71]:
sum = family_df.sum()

In [72]:
remain = sum - family_df['Family Count'].max()

In [73]:
remain

Family Count    354
dtype: int64

In [75]:
survived_rate_with_family = (remain / sum)* 100

In [76]:
survived_rate_without_family = (family_df['Family Count'].max()/sum)*100

In [77]:
survived_rate_with_family , survived_rate_without_family

(Family Count    39.73064
 dtype: float64,
 Family Count    60.26936
 dtype: float64)

#### For each passenger, calculate the age difference with the oldest sibling (if any) and the age difference with the youngest sibling (if any).`

#### Find the most common deck letter (A, B, C, etc.) for each passenger class.

In [154]:
df

      age     fare  alive
0    22.0   7.2500      0
1    38.0  71.2833      1
2    26.0   7.9250      1
3    35.0  53.1000      1
4    35.0   8.0500      0
..    ...      ...    ...
886  27.0  13.0000      0
887  19.0  30.0000      1
888   NaN  23.4500      0
889  26.0  30.0000      1
890  32.0   7.7500      0

[891 rows x 3 columns]

In [100]:
df.deck.value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

In [103]:
deck_series = pd.Series([59, 47, 33, 32, 15, 13, 4], index=['C', 'B', 'D', 'E', 'A', 'F', 'G'])
deck_df = pd.DataFrame({'Deck Count': deck_series})

In [112]:
most_common_deck_per_class = df.groupby('pclass')['deck'].apply(lambda x: x.mode()[0])

In [113]:
most_common_deck_per_class

pclass
1    C
2    F
3    F
Name: deck, dtype: object

In [115]:
df.groupby('pclass')['deck'].size()

pclass
1    216
2    184
3    491
Name: deck, dtype: int64

#### Group the Titanic DataFrame by 'Embarked' (port of embarkation) and find the percentage of passengers who survived in each group.`

In [135]:
df['alive'] = df.alive.apply(lambda x : 1 if x == 'yes' else 0)

In [137]:
df.groupby(['embarked'])['alive'].mean() * 100

embarked
C    55.357143
Q    38.961039
S    33.695652
Name: alive, dtype: float64

#### Calculate the correlation matrix for the 'Age', 'Fare', and 'Survived' columns in the Titanic dataset and find the feature with the highest absolute correlation with 'Survived'.

In [146]:
columns_of_concern = ['age' , 'fare' , 'alive']

In [142]:
r = df[columns_of_concern].corr()

In [143]:
r.alive.abs().idxmax()

'alive'

In [158]:
columns_of_concern1 = ['pclass', 'sex', 'age', 'fare']

In [159]:
df = df[columns_of_concern1]

#### Create a new DataFrame that contains the 'Pclass', 'Sex', 'Age', and 'Fare' columns from the Titanic dataset and pivot it to have 'Pclass' as the index, 'Sex' as the columns, and 'Fare' as the values, with 'Age' as the weights.

In [160]:
pivoted_df = df.pivot_table(index='pclass', columns='sex', values='fare', aggfunc='sum', fill_value=0, margins=True, margins_name='Total')

In [161]:
pivoted_df

sex         female        male       Total
pclass
1        9975.8250   8201.5875  18177.4125
2        1669.7292   2132.1125   3801.8417
3        2321.1086   4393.5865   6714.6951
Total   13966.6628  14727.2865  28693.9493